In [2]:
import pandas as pd

#Read and preview data
schools = pd.read_csv("schools.csv")
schools.head(3)

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1

#Finding schools with the best math scores